stresstest.yml
config:
  target: "http://localhost:3000"
  http:
    pool: 10
  phases:
    - duration: 30
      arrivalRate: 1
      name: 1 RPS
    - duration: 30
      arrivalRate: 10
      name: 10 RPS
    - duration: 60
      arrivalRate: 100
      name: 100 RPS
    - duration: 120
      arrivalRate: 500
      name: 1000 rps
scenarios:
  - flow:
    - get:
        url: "/{{ $randomNumber(9000000, 10000000) }}"